header.title = Ing\u00E9nieur Etude et D\u00E9veloppement

about.title = A propos de moi
about.content = \
Mon pr\u00E9nom est Renaud, je suis d\u00E9veloppeur et architecte JAVA/JEE. \
Passion ? code, design, nouvelles technologies. \
Objectif ? CONSTRUIRE des applications de qualit\u00E9 ! \
Je suis actuellement en poste dans la soci\u00E9t\u00E9 Active3D, \u00E9ditrice d'une plateforme WEB dans le domaine de la gestion technique du patrimoine immobilier. \
Je suis \u00E9galement un passionn\u00E9 de sport que je pratique r\u00E9guli\u00E8rement. \
Les technologies utilis\u00E9es, pour construire ce site web, sont HTML5/CSS/MDL/Sass/RiotJS/Javascript pour la partie front-end \
et Vert.x/Java/ElasticSearch pour la partie back-end. Ce n'est certainement pas la mani\u00E8re la plus rapide de mettre en place un site web de pr\u00E9sentation \
mais cela me permet tester ces technologies et de d\u00E9finir une stack web simple (pas de framework lourd d'utilisation), efficace, \u00E9volutive, \u00E9lastique pour des projets plus importants !
about.citation = "On a deux vies, et la deuxi\u00E8me commence quand on se rend compte qu'on en a qu'une." @Confucius

skill.title = Comp\u00E9tences

xp.title = Experience
xp.developer.header = Ing\u00E9nieur \u00E9tude et d\u00E9veloppement / Architecte JAVA/JEE
xp.developer.body = \
soci\u00E9t\u00E9 Active3D (\u00E9quipe de dix d\u00E9veloppeurs), \u00E9ditrice d\u2019une plateforme web de gestion technique de patrimoine immobilier.  \
D\u00E9veloppements JAVA/JEE des modules r\u00E9f\u00E9rentiel patrimoine (IFC/BIM), gestion des \u00E9nergies et fluides, workflow, administration (droits utilisateurs).
xp.backend.body =  architecture, cache applicatif, s\u00E9curit\u00E9 (session, https, chiffrement asym\u00E9trique), authentification (SSO, LDAP), transactions, Webservices, micro-services.
xp.database.header = Base de donn\u00E9es
xp.database.body = Oracle (SQL, PL/SQL)
xp.frontend.body = Swing, GWT, Vaadin
xp.quality.header = Qualit\u00E9
xp.quality.body = automatisation des tests, optimisation des performances, monitoring.
xp.lead.header = Responsable D\u00E9veloppement \u00E0 Casablanca (Maroc)
xp.lead.body = Mise en place, gestion et encadrement de la cellule de d\u00E9veloppement (10 d\u00E9veloppeurs).
xp.rd.header = Ing\u00E9nieur Recheche et D\u00E9veloppement
xp.rd.body = R\u00E9alisation d\u2019une plateforme web collaborative dans le domaine du b\u00E2timent (Active3D).
xp.conference.header = Conf\u00E9rences internationales et nationales en informatique
xp.conference.body =  Chicago ER'03, New Orleans ACM CIKM\u201903, Eindhoven AH'04, Lyon ICDIM\u201907.
xp.teaching.header = Enseignements \u00E0 l\u2019universit\u00E9 de Bourgogne
xp.teaching.body = Algorithmique et programmation, UML, Java.

educ.title = Formation
educ.phd.header = DOCTEUR en sciences sp\u00E9cialit\u00E9 Informatique
educ.phd.body = au laboratoire LE2i \u00E0 Dijon (Web s\u00E9mantique).
educ.master2.header = DEA Instrumentation et Informatique de l\u2019Image
educ.master2.body = \u00E0 l\u2019universit\u00E9 de Bourgogne (21).
educ.master1.header = Ma\u00EEtrise d\u2019informatique
educ.master1.body = \u00E0 l\u2019universit\u00E9 Paul-Sabatier de Toulouse (31).
educ.licence.header = Licence d\u2019informatique
educ.licence.body = \u00E0 l\u2019universit\u00E9 Paul-Sabatier de Toulouse (31).
educ.deug.header = DEUG MIAS (Maths-Informatique)
educ.deug.body = \u00E0 l\u2019universit\u00E9 Paul-Sabatier de Toulouse (31).
educ.bac.header = Bac S
educ.bac.body = au lyc\u00E9e Jean de Prades de Castelsarrasin (82).

skilldetails.title = Details des comp\u00E9tences
skilldetails.language.header = Langages
skilldetails.architecture.body = web services (SOAP/XML), architecture client-serveur (RPC/JSON), REST microservices(Vertx), s\u00E9curit\u00E9 (SSL, authentification - SSO, LDAP), transaction, cache (Redis, EhCache, MapDB), r\u00E9seaux (http, tcp/ip, websocket), worflow (Activiti)
skilldetails.test.body = unitaires (JUnit), charges et performances (JMeter, VisualVM)
skilldetails.ws.header = Web s\u00E9mantique
skilldetails.system.header = Syst\u00E8mes
skilldetails.tools.header = Outils
skilldetails.pm.header = Gestion de projet
skilldetails.pm.body = M\u00E9thodes agiles (JIRA Agile), Kanban